Autodesk.Revit.DB.Lighting.LineLightShape.EmitLength
The emit length.
The emit length as a numerical value in feet between 1.0e-9 and 30000.0
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The shape dimension is not valid because it is not between 1.0e-9 and 30000.0.
Since:
2013

Autodesk.Revit.DB.Lighting.LineLightShape.#ctor(Autodesk.Revit.DB.Lighting.LineLightShape)
Creates a copy of the given line light shape
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.Lighting.LineLightShape.#ctor(System.Double)
Creates a line light shape object with the given emit length.
emitLength:
The emit length as a numerical value in feet between 1.0e-9 and 30000.0
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The shape dimension is not valid because it is not between 1.0e-9 and 30000.0.
Since:
2013

Autodesk.Revit.DB.Lighting.LineLightShape.#ctor
Creates a line light shape object with 2.0' emit length.
Since:
2013

Autodesk.Revit.DB.Lighting.LineLightShape
This class encapsulates a line light shape.
Since:
2013